Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus also supports https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] so, if you prefer JSON-B over Jackson, you can create a project relying on the RESTEasy JSON-B extension instead:
ja_jp: Quarkus は https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] もサポートしているため、 Jackson よりも JSON-B を利用したい場合は、代わりに RESTEasy JSON-B エクステンションを依存関係に持つプロジェクトを作成することができます。

source: Quarkus also supports https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] so, if you prefer JSON-B over Jackson, you can create a project relying on the RESTEasy Reactive JSON-B extension instead:
ja_jp: Quarkusは https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] もサポートしているので、JacksonよりもJSON-Bが好きな場合は、代わりにRESTEasy JSON-B エクステンションに依存したプロジェクトを作成することができます:

source: Quarkus also supports https://eclipse-ee4j.github.io/jsonb-api/[JSON-B], so if you prefer JSON-B over Jackson, you can create a project relying on the RESTEasy JSON-B extension instead:
ja_jp: Quarkus は https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] もサポートしているため、Jackson よりも JSON-B を利用したい場合は、代わりに RESTEasy JSON-B エクステンションを依存関係に持つプロジェクトを作成することができます。

source: Quarkus also supports role-based access control (RBAC). For more information about RBAC and other authorization options in Quarkus, see xref:security-authorization.adoc[Security authorization].
ja_jp: Quarkusは、ロールベースのアクセスコントロール（RBAC）もサポートしています。RBACとQuarkusのその他の認可オプションの詳細については、 xref:security-authorization.adoc[セキュリティ認可] を参照してください。

source: Quarkus also supports the use of the same `@ConfigProperties` object with different prefixes for each injection point using the `io.quarkus.arc.config.@ConfigPrefix` annotation. If `GreetingConfiguration` from above needs to be used for both the `greeting` prefix and the `other` prefix:
ja_jp: また、Quarkusでは、 `io.quarkus.arc.config.@ConfigPrefix` アノテーションを使用して、同じ `@ConfigProperties` オブジェクトを注入ポイントごとに異なるプレフィックスで使用することもサポートしています。上記の `GreetingConfiguration` が、 `greeting` のプレフィックスと `other` のプレフィックスの両方に使用される必要がある場合は以下のようにします。

source: Quarkus and Gradle
ja_jp: QuarkusとGradle

source: Quarkus and Maven
ja_jp: QuarkusとMaven

source: Quarkus and the RabbitMQ connector support https://www.vaultproject.io/docs/secrets/rabbitmq[Vault's RabbitMQ secrets engine] for generating short-lived dynamic credentials. This allows Vault to create and retire RabbitMQ credentials on a regular basis.
ja_jp: Quarkus と RabbitMQ コネクターは、短期間の動的クレデンシャルを生成するために https://www.vaultproject.io/docs/secrets/rabbitmq[Vault の RabbitMQ シークレットエンジン] をサポートしています。これにより、Vault は定期的に RabbitMQ クレデンシャルを作成および廃止できます。

source: Quarkus application builds are ran in isolated processes using Gradle's worker API. This includes the Quarkus application build and Quarkus code generation. This is necessary to properly pass the configuration from the `quarkus` extension and Gradle project properties to Quarkus' code generator / application builder.
ja_jp: Quarkusアプリケーションのビルドは、GradleのワーカーAPIを使用して、分離されたプロセスで実行されます。これには、QuarkusアプリケーションのビルドとQuarkusのコード生成が含まれます。これは、 `quarkus` エクステンションと Gradle プロジェクトのプロパティから Quarkus のコード生成/アプリケーションビルダーに設定を適切に渡すために必要です。

source: Quarkus application configuration may include two types of configuration options:
ja_jp: Quarkusのアプリケーション設定には、2種類の設定オプションがあります。

source: Quarkus applications are Java applications. So, somewhere there is a `public static void main(String... args)`. While you don't need to write that method when using Quarkus, it can still be convenient and give you more control about your application startup. It's also a good trick to start your Quarkus application directly from your IDE.
ja_jp: QuarkusのアプリケーションはJavaアプリケーションです。そのため、どこかに `public static void main(String…​ args)` が存在します。Quarkusを使用する際にそのメソッドを記述する必要はありませんが、それでも便利で、アプリケーションの起動についてより多くのコントロールが可能になります。また、IDEから直接Quarkusアプリケーションを起動するのも良いでしょう。

source: Quarkus applications are designed to run in containers.
ja_jp: Quarkusアプリケーションはコンテナ内で実行されるように設計されています。

source: Quarkus applications are optimised for low memory usage and fast startup times.
ja_jp: Quarkusアプリケーションは、メモリ使用量が少なく、起動時間が短いように最適化されています。

source: Quarkus applications can access and use the Vert.x APIs.
ja_jp: QuarkusのアプリケーションはVert.xのAPIにアクセスして使用することができます。

source: Quarkus applications can be run as a normal jar-based JVM application, or live-coded in dev mode, or compiled to a native binary. Each environment places different demands on framework extensions.
ja_jp: Quarkus アプリケーションは通常の jar ベースの JVM アプリケーションとして実行できます。 または、開発モードでライブコーディングするか、ネイティブバイナリーにコンパイルします。 各環境では、フレームワーク拡張に対する要求が異なります。

source: Quarkus applications can now automatically register to Consul, using the Stork extension.
ja_jp: Quarkus アプリケーションは、Stork エクステンション を使用して Consul に自動的に登録できるようになりました。

source: Quarkus applications that want to include extensions from a Quarkus platform will be importing the Quarkus platform BOM.
ja_jp: QuarkusプラットフォームからエクステンションをインクルードしたいQuarkusアプリケーションは、QuarkusプラットフォームのBOMをインポートします。

source: Quarkus auto-detects batch types for incoming channels and sets batch configuration automatically. You can configure batch mode explicitly with `mp.messaging.incoming.$channel.batchReceive` property.
ja_jp: Quarkus は、着信チャネルのバッチタイプを自動検出し、バッチ設定を自動的に設定します。 `mp.messaging.incoming.$channel.batchReceive` プロパティーを使用して、バッチモードを明示的に設定できます。

source: Quarkus autodetects batch types for incoming channels and sets batch configuration automatically. You can configure batch mode explicitly with `mp.messaging.incoming.$channel.batch` property.
ja_jp: Quarkus は、着信チャネルのバッチタイプを自動検出し、バッチ設定を自動的に設定します。 `mp.messaging.incoming.$channel.batch` プロパティーを使用して、バッチモードを明示的に設定できます。

source: Quarkus automates the registration of Jackson's Mixin support, via the `io.quarkus.jackson.JacksonMixin` annotation. This annotation can be placed on classes that are meant to be used as Jackson mixins while the classes they are meant to customize are defined as the value of the annotation.
ja_jp: Quarkus は、 `io.quarkus.jackson.JacksonMixin` アノテーションを介して、Jackson の Mixin サポートの登録を自動化します。 このアノテーションは、Jackson mixin として使用することを意図したクラスに配置できますが、カスタマイズすることを意図したクラスはアノテーションの値として定義されます。

source: Quarkus automatically generates serializers and deserializers for channels where:
ja_jp: Quarkus は、以下の場合のチャネルのシリアライザーおよびデシリアライザーを自動的に生成します。

source: Quarkus automatically includes the resources present in `META-INF/resources` (the web resources) but, outside of this directory, you are on your own.
ja_jp: Quarkus では、 `META-INF/resources` (Web リソース) にあるリソースが自動的に含まれていますが、このディレクトリー以外の場所では自己責任でお願いします。

source: Quarkus automatically includes the resources present in `META-INF/resources` (the web resources) but, outside this directory, you are on your own.
ja_jp: Quarkus では、`META-INF/resources` (Web リソース) にあるリソースを自動的にインクルードしますが、このディレクトリー以外の場所は自分で設定する必要があります。

source: Quarkus automatically secures endpoints annotated with the authentication mechanism annotation. When no standard security annotation is present on the REST endpoint and resource, the `io.quarkus.security.Authenticated` annotation is added for you.
ja_jp: Quarkus は、認証メカニズムアノテーションが付けられたエンドポイントを自動的に保護します。REST エンドポイントとリソースに標準のセキュリティーアノテーションが存在しない場合は、 `io.quarkus.security.Authenticated` アノテーションが追加されます。

source: Quarkus automatically serves static resources located under the `META-INF/resources` directory.
ja_jp: Quarkus は、 `META-INF/resources` ディレクトリーの下にある静的リソースを自動的に提供します。

source: Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the contents from link:https://github.com/datastax/cassandra-quarkus/blob/main/quickstart/src/main/resources/META-INF/resources/fruits.html[this file] in it.
ja_jp: Quarkus は、`META-INF/resources` ディレクトリー配下にある静的リソースを自動的に提供します。`src/main/resources/META-INF/resources` ディレクトリーに、link:https://github.com/datastax/cassandra-quarkus/blob/main/quickstart/src/main/resources/META-INF/resources/fruits.html[このファイル] の内容を持つ `fruits.html` ファイルを追加してください。

source: Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the contents from link:src/main/resources/META-INF/resources/fruits.html[this file] in it.
ja_jp: Quarkus は、 `META-INF/resources` ディレクトリーの下にある静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリーに、link:src/main/resources/META-INF/resources/fruits.html[このファイル] の内容を含めて `fruits.html` ファイルを追加します。

source: Quarkus automatically uses:
ja_jp: Quarkus は以下を自動的に使用します。

source: Quarkus batches all the commands from a single file and sends all the commands. The loading process fails if there is any error, but the previous instructions may have been executed. To avoid that, you can wrap your command into a Redis _transaction_:
ja_jp: Quarkusは、1つのファイルからすべてのコマンドを一括して送信します。読み込み処理はエラーがあると失敗しますが、前の命令が実行されている可能性があります。それを避けるために、コマンドをRedis _トランザクション_ にラップすることができます:

source: Quarkus beans can use xref:cdi.adoc#events-and-observers[CDI observers] to consume authentication and authorization security events. The observers can be either synchronous or asynchronous.
ja_jp: Quarkus Beanは、 xref:cdi.adoc#events-and-observers[CDIオブザーバー] を使用して、認証や認可のセキュリティイベントを消費することができます。 オブザーバは同期でも非同期でもかまいません。

source: Quarkus believes in developer Joy.
ja_jp: Quarkus は、開発者の満足度を重要視しています。

source: Quarkus bootstrap includes a Maven resolver implementation that is used to resolve application runtime and build time dependencies. The Quarkus Maven resolver is initialized from the same Maven command line that launched the build, test or dev mode. Typically, there is no need to add any extra configuration for it. However, there could be cases where an extra configuration option may be necessary to properly resolve application dependencies in test or dev modes, or IDEs.
ja_jp: Quarkus ブートストラップには、アプリケーションのランタイムとビルド時間の依存関係を解決するために使用される Maven リゾルバーの実装が含まれています。Quarkus Maven リゾルバーは、ビルド、テスト、または開発モードを起動したのと同じ Maven コマンドラインから初期化されます。通常、設定を追加する必要はありません。ただし、テストモード、開発モード、または IDE でアプリケーションの依存関係を適切に解決するために、追加の設定オプションが必要になる場合があります。

source: Quarkus bootstrap itself
ja_jp: Quarkus のブートストラップ自体

source: Quarkus build is populated by these build steps and they are following a consumer/producer model with dependency injection. The items being consumed and produced are called ``BuildItem``s.
ja_jp: Quarkusのビルドには、これらのビルドステップが含まれており、依存性注入によるコンシューマー／プロデューサーモデルに従っています。消費されるアイテムと生産されるアイテムは、 `BuildItem` と呼ばれます。

source: Quarkus build steps can produce and consume various build items and hook into each phase. In the following sections we will describe all the relevant build items and common scenarios.
ja_jp: Quarkusのビルドステップでは、さまざまなビルドアイテムを生成したり消費したりして、各フェーズにフックすることができます。以下のセクションでは、関連するすべてのビルド項目と一般的なシナリオについて説明します。

source: Quarkus build steps can produce and consume various build items and hook into each phase. In the following sections, we will describe all the relevant build items and common scenarios.
ja_jp: Quarkus のビルドステップは、さまざまなビルドアイテムを生成および消費し、各フェーズにフックできます。以下のセクションでは、すべての関連するビルドアイテムと一般的なシナリオについて説明します。

source: Quarkus builds the application
ja_jp: Quarkus がアプリケーションをビルドする

source: Quarkus builds the application with the `aot-jar` packaging.
ja_jp: Quarkus は `aot-jar` パッケージングでアプリケーションをビルドします。

source: Quarkus caches logger instances internally. When you inject a logger into a `@RequestScoped` bean, Quarkus shares that logger across bean instances to avoid performance penalties from repeated logger instantiation.
ja_jp: Quarkus は内部的にロガーインスタンスをキャッシュします。 `@RequestScoped` Bean にロガーを注入する場合、ロガーの繰り返し生成によるパフォーマンス低下を避けるため、Quarkus は Bean インスタンス間でそのロガーを共有します。

source: Quarkus calls `KeyStoreProvider::getKeyStore` when the TLS configuration is <<startup-checks,initially created>> and any time the configuration is <<reloading-certificates,reloaded>>. The resulting keystore and options are then made available via `TlsConfiguration::getKeyStore` and `TlsConfiguration::getKeyStoreOptions`.
ja_jp: Quarkus は、TLS 設定が <<startup-checks,最初に作成されたとき>> および設定が <<reloading-certificates,再読み込み>> されるたびに、`KeyStoreProvider::getKeyStore` を呼び出します。その結果得られるキーストアとオプションは、`TlsConfiguration::getKeyStore` と `TlsConfiguration::getKeyStoreOptions` を介して利用可能になります。

source: Quarkus can also conditionally disable JAX-RS Resources based on the value of runtime properties using the `@io.quarkus.resteasy.reactive.server.EndpointDisabled` annotation.
ja_jp: Quarkusでは、 `@io.quarkus.resteasy.reactive.server.EndpointDisabled` アノテーションを使用して、実行時プロパティの値に基づいてJAX-RSリソースを条件付きで無効にすることも可能です。

source: Quarkus can also conditionally disable Jakarta REST Resources based on the value of runtime properties using the `@io.quarkus.resteasy.reactive.server.EndpointDisabled` annotation.
ja_jp: Quarkusでは、 `@io.quarkus.resteasy.reactive.server.EndpointDisabled` アノテーションを使用して、実行時プロパティの値に基づいてjakarta RESTリソースを条件付きで無効化することもできます。

source: Quarkus can also conditionally disable the generated Jakarta REST Resources based on the value of runtime properties using the `@io.quarkus.resteasy.reactive.server.EndpointDisabled` annotation.
ja_jp: Quarkusでは、 `@io.quarkus.resteasy.reactive.server.EndpointDisabled` アノテーションを使用して、実行時プロパティの値に基づいて、生成されたJakarta RESTリソースを条件付きで無効にすることもできます。

source: Quarkus can automatically build container images that include AOT caches, giving you fast startup times out of the box.
ja_jp: Quarkus は AOT キャッシュを含むコンテナーイメージを自動的にビルドできるため、すぐに高速な起動時間の恩恵を受けることができます。

source: Quarkus can be accessed through proxies that generate headers (e.g. `X-Forwarded-Host`) to preserve information about the original request. Quarkus can be configured to automatically update information like protocol, host, port and URI to use the values from those headers.
ja_jp: Quarkus は、ヘッダーを生成するプロキシ (例: `X-Forwarded-Host`) を通じてアクセスすることで、元のリクエストに関する情報を保持することができます。Quarkus は、これらのヘッダーの値を使用して、プロトコル、ホスト、ポート、URI などの情報を自動的に更新するように設定できます。

source: Quarkus can compress the produced native executable using UPX. More details on xref:./upx.adoc[UPX Compression documentation].
ja_jp: Quarkus は、UPX を使用して生成されたネイティブ実行可能ファイルを圧縮できます。詳細については、xref:./upx.adoc[UPX 圧縮のドキュメント] を参照してください。

source: Quarkus can compress your executable if you have installed UPX on your system or use an in-container build.
ja_jp: システムにUPXがインストールされているか、コンテナ内ビルドを使用している場合、Quarkusは実行可能ファイルを圧縮できます。

source: Quarkus can load the JWT bearer token from a file system. For example, in Kubernetes, a service account token projection can be mounted to a `/var/run/secrets/tokens` path. Then all you need to do is configure a JWT bearer token path as follows:
ja_jp: Quarkus はファイルシステムから JWT ベアラートークンを読み込むことができます。 たとえば、Kubernetes では、サービスアカウントトークンプロジェクションを `/var/run/secrets/tokens` パスにマウントできます。 次に、JWT ベアラートークンパスを次のように設定するだけです。

source: Quarkus can load the JWT bearer token from the file system. For example, in Kubernetes, a service account token projection can be mounted to a `/var/run/secrets/tokens` path. Then configure the JWT bearer token path as follows:
ja_jp: Quarkus はファイルシステムから JWT ベアラートークンをロードできます。たとえば、Kubernetes では、サービスアカウントトークンプロジェクションを `/var/run/secrets/tokens` パスにマウントできます。次に、JWT ベアラートークンパスを次のように設定します。

source: Quarkus can log the messages sent and received for debugging purposes. To enable traffic logging for the server, set the `quarkus.websockets-next.server.traffic-logging.enabled` configuration property to `true`. To enable traffic logging for the client, set the `quarkus.websockets-next.client.traffic-logging.enabled` configuration property to `true`. The payload of text messages is logged as well. However, the number of logged characters is limited. The default limit is 100, but you can change this limit with the `quarkus.websockets-next.server.traffic-logging.text-payload-limit` and `quarkus.websockets-next.client.traffic-logging.text-payload-limit` configuration property, respectively.
ja_jp: Quarkus は、デバッグの目的で送受信されたメッセージをログに記録できます。 サーバーのトラフィックロギングを有効にするには、 `quarkus.websockets-next.server.traffic-logging.enabled` 設定プロパティーを `true` に設定します。 クライアントのトラフィックロギングを有効にするには、 `quarkus.websockets-next.client.traffic-logging.enabled` 設定プロパティーを `true` に設定します。 テキストメッセージのペイロードも記録されます。 ただし、記録される文字数には制限があります。 デフォルトの制限は 100 ですが、 `quarkus.websockets-next.server.traffic-logging.text-payload-limit` および `quarkus.websockets-next.client.traffic-logging.text-payload-limit` 設定プロパティーをそれぞれ使用してこの制限を変更できます。

source: Quarkus can map fields of a secured method parameters to a custom permission constructor parameters. You can use this feature to pass `jakarta.ws.rs.BeanParam` parameters into your custom permission. Let's consider following Jakarta REST resource:
ja_jp: Quarkus は、保護されたメソッドパラメーターのフィールドをカスタム権限コンストラクターパラメーターにマップできます。 この機能を使用すると、 `jakarta.ws.rs.BeanParam` パラメーターをカスタム権限に渡すことができます。 次の Jakarta REST リソースを考えてみましょう。

source: Quarkus can serve static files from a local filesystem directory, outside of the application JAR and Java resources. This is configured via the `quarkus.http.static-dir.*` properties.
ja_jp: Quarkus は、アプリケーション JAR や Java リソースの外部にあるローカルファイルシステムのディレクトリーから静的ファイルを提供できます。これは `quarkus.http.static-dir.*` プロパティーを介して設定されます。

source: Quarkus can support *specific* properties sent to the container itself though, e.g. this is the case for `TC_MY_CNF` which allows to override the MariaDB/MySQL configuration file.
ja_jp: ただし、Quarkus はコンテナー自体に送信される *特定の* プロパティーをサポートできます。たとえば、MariaDB/MySQL 設定ファイルをオーバーライドできる `TC_MY_CNF` です。

source: Quarkus can support specific properties sent to the container itself though and, typically, this is the case for `TC_MY_CNF` which allows to override the MariaDB/MySQL configuration file.
ja_jp: Quarkusは、コンテナ自体に送信される特定のプロパティをサポートすることができます。典型的には、MariaDB/MySQL設定ファイルをオーバーライドできる `TC_MY_CNF` です。

source: Quarkus cannot determine at build time the type included in the `Response` as the information is not available. In this case, Quarkus won't be able to register for reflection in the required classes automatically.
ja_jp: Quarkus は、情報が利用できないため、ビルド時に `Response` に含まれるタイプを判別できません。 この場合、Quarkus は必要なクラスにリフレクションを自動的に登録できなくなります。

source: Quarkus chooses the default execution mode based on the method signature. If the method signature is _synchronous_, messages are dispatched on *worker threads* otherwise it defaults to *event-loop*:
ja_jp: Quarkus はメソッド署名に基づいてデフォルトの実行モードを選択します。 メソッド署名が _synchronous_ の場合、メッセージは *ワーカースレッド* にディスパッチされ、それ以外の場合はデフォルトで *イベントループ* にディスパッチされます。

source: Quarkus client API for data sources
ja_jp: データソースのためのQuarkusクライアントAPI

source: Quarkus collects the config property values injected in CDI beans during xref:writing-extensions.adoc#bootstrap-three-phases[static initialization phase]. The collected values are then compared with their runtime initialization counterparts and if a mismatch is detected the application startup fails. How can it happen? For example, let's have a CDI bean `org.acme.MyBean`. `MyBean` injects a `@ConfigProperty` of name `foo` and is initialized during the native build. The config property does not exist during the native build and so the default value `bar` is used. But later, when the application is started the property is defined with a system property: `-Dfoo=baz`. This would lead to inconsistent state and unexpected behavior. Therefore, Quarkus would fail in this situation by default.
ja_jp: Quarkus は、xref:writing-extensions.adoc#bootstrap-three-phases[静的初期化フェーズ] で CDI Bean に注入された設定プロパティー値を収集します。 収集された値はランタイムの初期化値と比較され、不一致が検出されるとアプリケーションの起動は失敗します。 どうしてそんなことが起こるのでしょうか? たとえば、 `org.acme.MyBean` という CDI Bean があるとします。 `MyBean` は `foo` という名前の `@ConfigProperty` を注入し、ネイティブビルド中に初期化されます。 ネイティブビルド中は設定プロパティーが存在しないため、デフォルト値 `bar` が使用されます。 しかし、後でアプリケーションが起動されると、プロパティーはシステムプロパティー `-Dfoo=baz` で定義されます。 これにより、一貫性のない状態と予期しない動作が発生します。 したがって、この状況になると Quarkus はデフォルトで失敗します。

source: Quarkus comes equipped with a https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#built-in-samplers[built-in sampler], and you also have the option to create your custom sampler.
ja_jp: Quarkus には https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#built-in-samplers[組み込みサンプラー] が装備されており、カスタムサンプラーを作成するオプションもあります。

source: Quarkus comes with GZip support (even though it is not enabled by default). The following configuration knobs allow to configure GZip support.
ja_jp: Quarkus では、デフォルトでは有効になっていませんが GZip をサポートしています。以下のプロパティーを使用して、GZipのサポートを設定することができます。

source: Quarkus comes with a CORS filter at the HTTP layer level. Read the xref:http-reference.adoc#cors-filter[HTTP Reference Documentation] to learn how to use it.
ja_jp: Quarkus には、HTTP レイヤーレベルの CORS フィルターが付属しています。使用方法については、xref:http-reference.adoc#cors-filter[HTTPリファレンスドキュメント] を参照してください。

source: Quarkus comes with a CORS filter which implements the `jakarta.servlet.Filter` interface and intercepts all incoming HTTP requests. It can be enabled in the Quarkus configuration file, `src/main/resources/application.properties`:
ja_jp: Quarkusには、 `jakarta.servlet.Filter` インターフェイスを実装し、すべての着信HTTPリクエストをインターセプトするCORSフィルターが付属しています。このフィルタは、Quarkusの設定ファイル（ `src/main/resources/application.properties` ）で有効にすることができます:

source: Quarkus comes with a CORS filter which implements the `javax.servlet.Filter` interface and intercepts all incoming HTTP requests. It can be enabled in the Quarkus configuration file, `src/main/resources/application.properties`:
ja_jp: Quarkus には、 `javax.servlet.Filter` インターフェースを実装し、すべての受信 HTTP リクエストを遮断する CORS フィルターが付属しています。これは、Quarkus の設定ファイル (`src/main/resources/application.properties`) で有効にすることができます。

source: Quarkus comes with a CORS filter. Read the xref:http-reference.adoc#cors-filter[HTTP Reference Documentation] to learn how to use it.
ja_jp: Quarkus には、 CORS フィルターが付属しています。使用方法については、 xref:http-reference.adoc#cors-filter[HTTP リファレンスドキュメント] を参照してください。

source: Quarkus comes with a Transaction Manager and uses it to coordinate and expose transactions to your applications.
ja_jp: QuarkusにはTransaction Managerが付属しており、これを使用してトランザクションを調整し、アプリケーションに公開します。

source: Quarkus comes with a Transaction Manager and uses it to coordinate and expose transactions to your applications. Each extension dealing with persistence will integrate with it for you. And you will explicitly interact with transactions via CDI. This guide will walk you through all that.
ja_jp: QuarkusにはTransaction Managerが付属しており、これを使用してトランザクションを調整してアプリケーションに公開します。永続性を扱う各エクステンションは、これと統合されます。そして、CDIを介して明示的にトランザクションと対話することになります。このガイドでは、これらすべてについて説明します。

source: Quarkus comes with a built-in development mode. Run your application with:
ja_jp: Quarkusには開発モードが組み込まれています。以下でアプリケーションを実行します。

source: Quarkus comes with a built-in development mode. You can start it with:
ja_jp: Quarkusには開発モードが組み込まれています。以下のコマンドで起動することができます:

source: Quarkus comes with a toolchain enabling developers from live reload all the way down to deploying a Kubernetes application. In addition there are plugins and extensions to all major IDEs.
ja_jp: Quarkus には、開発者がライブリロードから Kubernetes アプリケーションのデプロイまでを可能にするツールチェーンが付属しています。加えて、全ての主要なIDEに対するプラグインも存在します。

source: Quarkus comes with a toolchain enabling developers from live reload all the way down to deploying a Kubernetes application. In addition, there are plugins and extensions to all major IDEs.
ja_jp: Quarkus には、開発者がライブリロードから Kubernetes アプリケーションのデプロイまでを可能にするツールチェーンが付属しています。加えて、全ての主要なIDEに対するプラグインも存在します。

source: Quarkus comes with a toolchain to help you at all development stages. You can use Maven or Gradle as build tool. And we offer a CLI that is convenient to use (coming soon).
ja_jp: Quarkus には、すべての開発段階で役立つツールチェーンが付属しています。ビルドツールとして Maven や Gradle を使うことができます。また、使い勝手の良いネイティブ CLI も提供しています (近日公開予定)。

source: Quarkus comes with a toolchain to help you at all development stages. You can use Maven or Gradle as build tool. And we offer a CLI that is convenient to use.
ja_jp: Quarkusには、すべての開発段階で役立つツールチェーンが付属しています。 ビルドツールとしてMavenまたはGradleを使用できます。 また、使いやすいCLIも提供しています。
